index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Exact Print Annotations in GHC (HIW 2021)</title>
<meta name="author" content="(Alan Zimmerman)"/>
<link rel="stylesheet" href="file:///home/alanz/mysrc/github/alanz/hiw2021/dist/reveal.css"/>

<link rel="stylesheet" href="file:///home/alanz/mysrc/github/alanz/hiw2021/dist/theme/white.css" id="theme"/>

<link rel="stylesheet" href="./local.css"/>
</head>
<body>
<div class="reveal">
<div class="slides">

<section>
<section id="slide-org3e22d5a">
<h2 id="org3e22d5a">Exact Print Annotations in GHC</h2>
<ul>
<li>Alan Zimmerman</li>
<li><a href="https://twitter.com/@alan_zimm"><code class="src src-haskell"><span style="color: #a0522d;">@</span>alan_zimm</code></a></li>

</ul>

<aside class="notes">
<p>
If you recall I spoke last year about the plan to move the exact print
annotations and their processing into GHC. Today I report on the
results.
</p>

<p>
And the goal is to give a 10,000ft overview to
a) Orient GHC developers / API users who wonder what on earth this is
b) Give some pointers for previous users of ghc-exactprint as to what
   will have to change.
</p>

</aside>

</section>
</section>
<section>
<section id="slide-org26e9eeb">
<h2 id="org26e9eeb">Exact Printing</h2>
<div class="org-src-container">

<pre  class="fragment appear" ><code trim>0x01, 001, 0_01
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment appear" ><code trim><span style="color: #4169e1;">{-# Language CPP #-}</span>
<span style="color: #4169e1;">{-# LANGUAGE CPP #-}</span>
</code></pre>
</div>

<aside class="notes">
<p>
But first an overview of what exact printing is, and why it is
important for tooling.
</p>

<p>
As its name suggests, exact printing aims to reproduce exactly the
original source of a file parsed by GHC.
</p>

<p>
It does this by storing the exact original forms and locations of all
parts of the original.
</p>

<p>
Apart from the obvious things like keywords, comments and so on, basic
things like literals also need special treatment.
</p>

</aside>

</section>
</section>
<section>
<section id="slide-org3c8153b">
<h3 id="org3c8153b">For Tooling</h3>
<div class="org-src-container">

<pre  class="src src-haskell" ><code trim><span style="color: #0000ff;">foo</span> xxx <span style="color: #a0522d;">=</span> <span style="color: #a020f0;">let</span> a <span style="color: #a0522d;">=</span> 1
              b <span style="color: #a0522d;">=</span> 2
          <span style="color: #a020f0;">in</span> xxx <span style="color: #a0522d;">+</span> a <span style="color: #a0522d;">+</span> b
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment appear" ><code trim><span style="color: #0000ff;">foo</span> xxxlonger <span style="color: #a0522d;">=</span> <span style="color: #a020f0;">let</span> a <span style="color: #a0522d;">=</span> 1
                    b <span style="color: #a0522d;">=</span> 2
                <span style="color: #a020f0;">in</span> xxxlonger <span style="color: #a0522d;">+</span> a <span style="color: #a0522d;">+</span> b
</code></pre>
</div>

<aside class="notes">
<p>
Exact printing in GHC has a further goal though, to allow the parsed
AST to be modified, and then exact printed so that all the unchanged
parts remain exactly the same. This allows us to write tools to modify
code, e.g. adding a new import, without disturbing all the rest of the
file.
</p>

<p>
This is complicated by the fact that haskell is layout sensitive, so
special care must be taken when moving a piece of code from one place
to another where its indentation may change.
</p>

</aside>


</section>
</section>
<section>
<section id="slide-org88215a7">
<h2 id="org88215a7">Changes (GHC 9.2)</h2>
<ul>
<li class="fragment appear">The Exact Print Annotations are now in-tree</li>
<li class="fragment appear"><code class="src src-haskell">ghc<span style="color: #0000ff;">-</span>exactprint</code> is still the library to programme against</li>
<li class="fragment appear">This has been updated heavily for use with GHC 9.2.1</li>

</ul>


</section>
</section>
<section>
<section id="slide-org5f5a0f7">
<h2 id="org5f5a0f7"><code class="src src-haskell">ghc<span style="color: #0000ff;">-</span>exactprint <span style="color: #a0522d;">=&gt;</span> <span style="color: #228b22;">GHC</span> <span style="color: #228b22;">Exactprint</span></code></h2>
<ul>
<li class="fragment appear">Indirect tie-up of API Annotations is gone</li>
<li class="fragment appear">We no longer have a two-phased approach</li>
<li class="fragment appear">We no longer need to add default annotations</li>

</ul>

<aside class="notes">
<p>
Exact printing has been available for tool writers since GHC 7.10.
</p>

<p>
What is changing from GHC 9.2 is that the locations of the additional
items, trivia as they are called in Swift and Rust, are now captured
more directly inside the GHC AST.
</p>

<p>
This has three main effects, from the perspective of tool writers
</p>

<ul>
<li>The indirect tie-up of the API Annotations (as they was called before)
via a SrcSpan and constructor name is gone, the information is now
captured directly in the AST.</li>

<li>We no longer have a two-phased approach, where the as-parsed
annotations are massaged into their delta variants before they can
be manipulated or printed.</li>

<li>We no longer need to add default annotations, recent GHC is tested
to be able to re-parse any pretty printed output back to the same
AST.</li>

</ul>

<p>
There are a other incidental changes too, like the old concept of API
Annotations has now become Exact Print Annotations, and we have a lot
more data structures.
</p>

</aside>

</section>
</section>
<section>
<section id="slide-org0fed4d0">
<h3 id="org0fed4d0">Aside: AST</h3>
<ul>
<li><code class="src src-haskell">Language<span style="color: #0000ff;">.</span>Haskell.Syntax</code></li>
<li><code class="src src-haskell">GHC<span style="color: #0000ff;">.</span>Hs</code></li>

</ul>


<div class="org-src-container">

<pre  class="fragment appear" ><code trim><span style="color: #a020f0;">type</span> <span style="color: #228b22;">ParsedSource</span> <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Located</span> <span style="color: #228b22;">HsModule</span>
</code></pre>
</div>

<aside class="notes">
<p>
One of the other changes coming in GHC 9.2 is an internal
restructuring of the modules making up GHC itself.
</p>

<p>
For our purposes, this means that the old GHC.Hs has been split into
</p>

<ul>
<li>Language.Haskell.Syntax</li>
<li>GHC.Hs</li>

</ul>

<p>
The first one is the completely general AST that can eventually be
used for e.g. TH, and does not specify the interpretation of the TTG
extension points.
</p>

<p>
Terminology: When I use the word AST, I am talking about the
ParsedSource which is defined in GHC.Hs,
and includes the GHC-specific interpretation of the TTG extension
points, which are used for the exact print annotations.
</p>

</aside>

</section>
</section>
<section>
<section id="slide-orgce0a250">
<h3 id="orgce0a250">XRec</h3>
<div class="org-src-container">

<pre  class="fragment appear" ><code trim><span style="color: #a020f0;">type</span> <span style="color: #228b22;">LHsExpr</span> p <span style="color: #a0522d;">=</span> <span style="color: #228b22;">XRec</span> p (<span style="color: #228b22;">HsExpr</span> p)
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment roll-in" ><code trim><span style="color: #a020f0;">type</span> <span style="color: #a020f0;">family</span> <span style="color: #228b22;">XRec</span> p a <span style="color: #a0522d;">=</span> r <span style="color: #a0522d;">|</span> r <span style="color: #a0522d;">-&gt;</span> a
<span style="color: #a020f0;">type</span> <span style="color: #a020f0;">instance</span> <span style="color: #228b22;">XRec</span> (<span style="color: #228b22;">GhcPass</span> p) a <span style="color: #a0522d;">=</span> <span style="color: #228b22;">GenLocated</span> (<span style="color: #228b22;">Anno</span> a) a
<span style="color: #a020f0;">type</span> <span style="color: #a020f0;">family</span> <span style="color: #228b22;">Anno</span> a <span style="color: #a0522d;">=</span> b
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment appear" ><code trim><span style="color: #a020f0;">type</span> <span style="color: #a020f0;">instance</span> <span style="color: #228b22;">Anno</span> (<span style="color: #228b22;">HsExpr</span> (<span style="color: #228b22;">GhcPass</span> p)) <span style="color: #a0522d;">=</span> <span style="color: #228b22;">SrcSpanAnnA</span>
</code></pre>
</div>

<aside class="notes">
<p>
The first thing you will notice about the new AST is that it is
littered with XRec types.
</p>

<p>
XRec is a type family where the p and a parameters determine r, and in
turn r determines a.
</p>

<p>
The instance for (GhcPass p) and a maps to GenLocated (Anno a) a.
Anno a is just a type family which maps an exact print annotation type
based on the type being annotated. And this is likely to change, given
that sometimes a given type needs a different annotation when it is
used in a different context.
</p>

<p>
This machinery for going from an XRec declaration to the actual
annotation to be used is very awkward to use in practice, especially
since the split into Language.Haskell.Syntax and GHC.Hs means the XRec
definitions occur in one branch of the source tree and their
resolutions in another, and not always in an easily searchable way, as
the type family resolves on the expanded synonym form.
</p>

</aside>

</section>
</section>
