index.org
** XRec example
Credit to Shayne Fletcher

#+begin_src haskell
  - LHsExpr GhcPs
  - XRec GhcPs (HsExpr GhcPs)
  - GenLocated (Anno (HsExpr GhcPs)) (HsExpr GhcPs)
  - GenLocated SrcSpanAnnA (HsExpr GhcPs)
  - LocatedA (HsExpr GhcPs))
#+end_src

#+ATTR_REVEAL: :frag appear
Expanding further we have
#+ATTR_REVEAL: :frag appear
#+begin_src haskell
- GenLocated SrcSpanAnnA (HsExpr GhcPs)
- GenLocated (SrcAnn AnnListItem) (HsExpr GhcPs)
- GenLocated (SrcSpanAnn' (EpAnn AnnListItem)) (HsExpr GhcPs)
#+end_src


#+begin_notes
To see how this works, consider what that means for the located
expression type LHsExpr GhcPs in GHC.
#+end_notes

* GHC Dev Survival Guide

All is not lost.

#+ATTR_REVEAL: :frag appear
src_haskell{A} is your friend

#+ATTR_REVEAL: :frag appear
#+begin_src haskell
  getLoc     => getLocA
  noLoc      => noLocA
  locA -- get SrcSpan from GenLocated payload
  setSrcSpan => setSrcSpanA
  addLocM    => addLocMA
#+end_src

** Changes: ghc-exactprint types

#+begin_src haskell
data Annotation = Ann
  {
    -- interfacing up into the AST
    annEntryDelta      :: !DeltaPos
  , annPriorComments   :: ![(Comment,  DeltaPos)]
  , annFollowingComments   :: ![(Comment,  DeltaPos)]
  -- interfacing down into the AST
  , annsDP             :: ![(KeywordId, DeltaPos)]
  , annSortKey         :: !(Maybe [GHC.RealSrcSpan])
  }
#+end_src

#+ATTR_REVEAL: :frag appear
#+begin_src haskell
data EpAnn ann
  = EpAnn { entry   :: Anchor
          , anns     :: ann
          , comments :: EpAnnComments
          }
  | EpAnnNotUsed
#+end_src

#+ATTR_REVEAL: :frag appear
#+begin_src haskell
data Anchor = Anchor { anchor :: RealSrcSpan
                     , anchor_op :: AnchorOperation }
data AnchorOperation = UnchangedAnchor
                     | MovedAnchor DeltaPos
#+end_src

#+begin_notes
In prior ghc-exactprint we had the output of the delta phase give us
an Annotation type.

This is linked to the AST item it documents by a combination
of the SrcSpan of the item and the constructor name.

Here the annEntryDelta defines where this piece of AST fits in
relative to any prior pieces, the comments are split into ones before
the entry point and after, but still within the span of the given AST
element.

The annsDP is the location of the trivia fields indexed by KeywordId.

The Exact Print Annotations mirror this

But the Anchor is more flexible
#+end_notes

** Annotation

#+begin_src haskell
  | HsLet (XLet p)
          (HsLocalBinds p)
          (LHsExpr  p)
#+end_src

#+begin_src haskell
type instance XLet GhcPs = EpAnn AnnsLet
data AnnsLet = AnnsLet { alLet :: EpaLocation,
                         alIn  :: EpaLocation }
#+end_src

#+REVEAL: split

#+begin_src haskell
type instance Anno (HsExpr (GhcPass p)) = SrcSpanAnnA
#+end_src

#+ATTR_REVEAL: :frag appear
#+begin_src haskell
type LocatedA = GenLocated SrcSpanAnnA
#+end_src

#+begin_src haskell
newtype DeltaPos = DP (Int,Int)
#+end_src

#+ATTR_REVEAL: :frag appear
#+begin_src haskell
data DeltaPos
  = SameLine { deltaColumn :: !Int }
  | DifferentLine
      { deltaLine   :: !Int, -- ^ deltaLine should always be > 0
        deltaColumn :: !Int
      }
#+end_src

#+begin_notes
Here we have an example of the new annotations, where the trivia are
explicitly named and managed in their own type.
#+end_notes

