index.html
<section>
<section id="slide-org0062b2b">
<h3 id="org0062b2b">XRec example</h3>
<p>
Credit to Shayne Fletcher
</p>

<div class="org-src-container">

<pre  class="src src-haskell" ><code trim><span style="color: #a0522d;">-</span> <span style="color: #228b22;">LHsExpr</span> <span style="color: #228b22;">GhcPs</span>
<span style="color: #a0522d;">-</span> <span style="color: #228b22;">XRec</span> <span style="color: #228b22;">GhcPs</span> (<span style="color: #228b22;">HsExpr</span> <span style="color: #228b22;">GhcPs</span>)
<span style="color: #a0522d;">-</span> <span style="color: #228b22;">GenLocated</span> (<span style="color: #228b22;">Anno</span> (<span style="color: #228b22;">HsExpr</span> <span style="color: #228b22;">GhcPs</span>)) (<span style="color: #228b22;">HsExpr</span> <span style="color: #228b22;">GhcPs</span>)
<span style="color: #a0522d;">-</span> <span style="color: #228b22;">GenLocated</span> <span style="color: #228b22;">SrcSpanAnnA</span> (<span style="color: #228b22;">HsExpr</span> <span style="color: #228b22;">GhcPs</span>)
<span style="color: #a0522d;">-</span> <span style="color: #228b22;">LocatedA</span> (<span style="color: #228b22;">HsExpr</span> <span style="color: #228b22;">GhcPs</span>))
</code></pre>
</div>

<p class="fragment appear">
Expanding further we have
</p>
<div class="org-src-container">

<pre  class="fragment appear" ><code trim><span style="color: #a0522d;">-</span> <span style="color: #228b22;">GenLocated</span> <span style="color: #228b22;">SrcSpanAnnA</span> (<span style="color: #228b22;">HsExpr</span> <span style="color: #228b22;">GhcPs</span>)
<span style="color: #a0522d;">-</span> <span style="color: #228b22;">GenLocated</span> (<span style="color: #228b22;">SrcAnn</span> <span style="color: #228b22;">AnnListItem</span>) (<span style="color: #228b22;">HsExpr</span> <span style="color: #228b22;">GhcPs</span>)
<span style="color: #a0522d;">-</span> <span style="color: #228b22;">GenLocated</span> (<span style="color: #228b22;">SrcSpanAnn'</span> (<span style="color: #228b22;">EpAnn</span> <span style="color: #228b22;">AnnListItem</span>)) (<span style="color: #228b22;">HsExpr</span> <span style="color: #228b22;">GhcPs</span>)
</code></pre>
</div>


<aside class="notes">
<p>
To see how this works, consider what that means for the located
expression type LHsExpr GhcPs in GHC.
</p>

</aside>

</section>
</section>
<section>
<section id="slide-org3a846da">
<h2 id="org3a846da">GHC Dev Survival Guide</h2>
<p>
All is not lost.
</p>

<p class="fragment appear">
<code class="src src-haskell"><span style="color: #228b22;">A</span></code> is your friend
</p>

<div class="org-src-container">

<pre  class="fragment appear" ><code trim><span style="color: #0000ff;">getLoc</span>     <span style="color: #0000ff;">=&gt;</span> getLocA
<span style="color: #0000ff;">noLoc</span>      <span style="color: #0000ff;">=&gt;</span> noLocA
locA <span style="color: #b22222;">-- </span><span style="color: #b22222;">get SrcSpan from GenLocated payload</span>
<span style="color: #0000ff;">setSrcSpan</span> <span style="color: #0000ff;">=&gt;</span> setSrcSpanA
<span style="color: #0000ff;">addLocM</span>    <span style="color: #0000ff;">=&gt;</span> addLocMA
</code></pre>
</div>

</section>
</section>
<section>
<section id="slide-orgc19c3ca">
<h3 id="orgc19c3ca">Changes: ghc-exactprint types</h3>
<div class="org-src-container">

<pre  class="src src-haskell" ><code trim><span style="color: #a020f0;">data</span> <span style="color: #228b22;">Annotation</span> <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Ann</span>
  {
    <span style="color: #b22222;">-- </span><span style="color: #b22222;">interfacing up into the AST</span>
    annEntryDelta      <span style="color: #a0522d;">::</span> <span style="color: #a0522d;">!</span><span style="color: #228b22;">DeltaPos</span>
  , annPriorComments   <span style="color: #a0522d;">::</span> <span style="color: #a0522d;">!</span>[(<span style="color: #228b22;">Comment</span>,  <span style="color: #228b22;">DeltaPos</span>)]
  , annFollowingComments   <span style="color: #a0522d;">::</span> <span style="color: #a0522d;">!</span>[(<span style="color: #228b22;">Comment</span>,  <span style="color: #228b22;">DeltaPos</span>)]
  <span style="color: #b22222;">-- </span><span style="color: #b22222;">interfacing down into the AST</span>
  , annsDP             <span style="color: #a0522d;">::</span> <span style="color: #a0522d;">!</span>[(<span style="color: #228b22;">KeywordId</span>, <span style="color: #228b22;">DeltaPos</span>)]
  , annSortKey         <span style="color: #a0522d;">::</span> <span style="color: #a0522d;">!</span>(<span style="color: #228b22;">Maybe</span> [<span style="color: #228b22;">GHC.RealSrcSpan</span>])
  }
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment appear" ><code trim><span style="color: #a020f0;">data</span> <span style="color: #228b22;">EpAnn</span> ann
  <span style="color: #a0522d;">=</span> <span style="color: #228b22;">EpAnn</span> { entry   <span style="color: #a0522d;">::</span> <span style="color: #228b22;">Anchor</span>
          , anns     <span style="color: #a0522d;">::</span> ann
          , comments <span style="color: #a0522d;">::</span> <span style="color: #228b22;">EpAnnComments</span>
          }
  <span style="color: #a0522d;">|</span> <span style="color: #228b22;">EpAnnNotUsed</span>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment appear" ><code trim><span style="color: #a020f0;">data</span> <span style="color: #228b22;">Anchor</span> <span style="color: #a0522d;">=</span> <span style="color: #228b22;">Anchor</span> { anchor <span style="color: #a0522d;">::</span> <span style="color: #228b22;">RealSrcSpan</span>
                     , anchor_op <span style="color: #a0522d;">::</span> <span style="color: #228b22;">AnchorOperation</span> }
<span style="color: #a020f0;">data</span> <span style="color: #228b22;">AnchorOperation</span> <span style="color: #a0522d;">=</span> <span style="color: #228b22;">UnchangedAnchor</span>
                     <span style="color: #a0522d;">|</span> <span style="color: #228b22;">MovedAnchor</span> <span style="color: #228b22;">DeltaPos</span>
</code></pre>
</div>

<aside class="notes">
<p>
In prior ghc-exactprint we had the output of the delta phase give us
an Annotation type.
</p>

<p>
This is linked to the AST item it documents by a combination
of the SrcSpan of the item and the constructor name.
</p>

<p>
Here the annEntryDelta defines where this piece of AST fits in
relative to any prior pieces, the comments are split into ones before
the entry point and after, but still within the span of the given AST
element.
</p>

<p>
The annsDP is the location of the trivia fields indexed by KeywordId.
</p>

<p>
The Exact Print Annotations mirror this
</p>

<p>
But the Anchor is more flexible
</p>

</aside>

</section>
</section>
<section>
<section id="slide-orgce5fcbf">
<h3 id="orgce5fcbf">Annotation</h3>
<div class="org-src-container">

<pre  class="src src-haskell" ><code trim><span style="color: #a0522d;">|</span> <span style="color: #228b22;">HsLet</span> (<span style="color: #228b22;">XLet</span> p)
        (<span style="color: #228b22;">HsLocalBinds</span> p)
        (<span style="color: #228b22;">LHsExpr</span>  p)
</code></pre>
</div>

<div class="org-src-container">

<pre  class="src src-haskell" ><code trim><span style="color: #a020f0;">type</span> <span style="color: #a020f0;">instance</span> <span style="color: #228b22;">XLet</span> <span style="color: #228b22;">GhcPs</span> <span style="color: #a0522d;">=</span> <span style="color: #228b22;">EpAnn</span> <span style="color: #228b22;">AnnsLet</span>
<span style="color: #a020f0;">data</span> <span style="color: #228b22;">AnnsLet</span> <span style="color: #a0522d;">=</span> <span style="color: #228b22;">AnnsLet</span> { alLet <span style="color: #a0522d;">::</span> <span style="color: #228b22;">EpaLocation</span>,
                         alIn  <span style="color: #a0522d;">::</span> <span style="color: #228b22;">EpaLocation</span> }
</code></pre>
</div>

</section>
<section id="slide-orgce5fcbf-split">

<div class="org-src-container">

<pre  class="src src-haskell" ><code trim><span style="color: #a020f0;">type</span> <span style="color: #a020f0;">instance</span> <span style="color: #228b22;">Anno</span> (<span style="color: #228b22;">HsExpr</span> (<span style="color: #228b22;">GhcPass</span> p)) <span style="color: #a0522d;">=</span> <span style="color: #228b22;">SrcSpanAnnA</span>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment appear" ><code trim><span style="color: #a020f0;">type</span> <span style="color: #228b22;">LocatedA</span> <span style="color: #a0522d;">=</span> <span style="color: #228b22;">GenLocated</span> <span style="color: #228b22;">SrcSpanAnnA</span>
</code></pre>
</div>

<div class="org-src-container">

<pre  class="src src-haskell" ><code trim><span style="color: #a020f0;">newtype</span> <span style="color: #228b22;">DeltaPos</span> <span style="color: #a0522d;">=</span> <span style="color: #228b22;">DP</span> (<span style="color: #228b22;">Int</span>,<span style="color: #228b22;">Int</span>)
</code></pre>
</div>

<div class="org-src-container">

<pre  class="fragment appear" ><code trim><span style="color: #a020f0;">data</span> <span style="color: #228b22;">DeltaPos</span>
  <span style="color: #a0522d;">=</span> <span style="color: #228b22;">SameLine</span> { deltaColumn <span style="color: #a0522d;">::</span> <span style="color: #a0522d;">!</span><span style="color: #228b22;">Int</span> }
  <span style="color: #a0522d;">|</span> <span style="color: #228b22;">DifferentLine</span>
      { deltaLine   <span style="color: #a0522d;">::</span> <span style="color: #a0522d;">!</span><span style="color: #228b22;">Int</span>, <span style="color: #8b2252;">-- ^ deltaLine should always be &gt; 0</span>
        deltaColumn <span style="color: #a0522d;">::</span> <span style="color: #a0522d;">!</span><span style="color: #228b22;">Int</span>
      }
</code></pre>
</div>

<aside class="notes">
<p>
Here we have an example of the new annotations, where the trivia are
explicitly named and managed in their own type.
</p>

</aside>

</section>
</section>
